fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/РеализацияТоваровУслуг.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РеализацияТоваровУслуг</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <registerRecords>AccumulationRegister.ОбработкаЗаказов</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Основание</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Услуги</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/Documents/РеализацияТоваровУслуг/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли; 
	
	// ++ Кривошеев
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ВыборкаИзРезультатаЗапроса") Тогда 
		ЗаполнитьЗначенияСвойств(ЭтотОбъект,ДанныеЗаполнения);
	КонецЕсли; 
	// -- Кривошеев
КонецПроцедуры

// ++ Кривошеев
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	
	Если ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда 
		
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("Основание")); 
		
	КонецЕсли;
	
КонецПроцедуры 
// -- Кривошеев


Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;   
	
	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма"); 
	
	// ++ Кривошеев
	Если ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор,"ВидДоговора") = Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда
		Если  Товары.Количество() <> 0 Тогда
			
			ТекстСообщения = "По договору абонентского обслуживания не предусмотрена продажа товара. Очистите вкладку товары и повторите.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		ИначеЕсли Услуги.Количество() = 0 Тогда
			
			ТекстСообщения = "В документе должна быть указана услуга.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
			
		ИначеЕсли  Не НоменклатураЗаполненаВерно()Тогда
			
			ТекстСообщения = СтрШаблон("В акте реализации товаров и услуг с договором абонентского обслуживания в качестве услуг могут быть только два наименования:
			|%1 и 
			|%2.
			|Сохранение документа реализации товаров и услуг невозможно. ",
			Константы.BKM_НоменклатураАбонентскаяПлата.Получить(),
			Константы.BKM_НоменклатураРаботыСпециалиста.Получить());
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		ИначеЕсли  BKM_ДоработкаДокументаРеализацияТоваровИУслугСервер.НайтиСуществующийДокументРеализацияСДаннымиТекущегоОбъекта(ЭтотОбъект) <> Неопределено Тогда
			
			
			ТекстСообщения = "На текущий период по данному договору уже есть составленный документ.
			|Сохранение документа реализации товаров и услуг невозможно. ";
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ); 
			Возврат;
			
		КонецЕсли;
		
	КонецЕсли; 
	// -- Кривошеев
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;

	// ++ Кривошеев 
	ВидДоговора = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВидДоговора");
	
	Если ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.BKM_АбонентскоеОбслуживание Тогда
		
		Движение = Движения.ОбработкаЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Заказ = Основание;
		Движение.СуммаОтгрузки = СуммаДокумента; 
		
		Для Каждого ТекСтрокаТовары Из Товары Цикл
			Движение = Движения.ОстаткиТоваров.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Контрагент = Контрагент;
			Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
			Движение.Сумма = ТекСтрокаТовары.Сумма;
			Движение.Количество = ТекСтрокаТовары.Количество;
		КонецЦикла;
	Иначе 
		
		 
		СоздатьДвиженичBKM_ВыполненныеРаботыКлиенту(Отказ);
		Если Отказ Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;	
	// -- Кривошеев
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

  

// ++ Кривошеев
Функция НоменклатураЗаполненаВерно()
	
	Для Каждого Услуга Из Услуги Цикл
		Если Услуга.Номенклатура <> Константы.BKM_НоменклатураАбонентскаяПлата.Получить() 
			И Услуга.Номенклатура <> Константы.BKM_НоменклатураРаботыСпециалиста.Получить() Тогда
			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Истина;	
	
КонецФункции


Процедура СоздатьДвиженичBKM_ВыполненныеРаботыКлиенту(Отказ)
	
	Если Не  BKM_ДоработкаДокументаРеализацияТоваровИУслугСервер.ДокументРеализацииТоваровИУслугЗаполненВерно(ЭтотОбъект) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	
	
	Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
	Движения.BKM_ВыполненныеКлиентуРаботы.Записать();
	
	Блокировка = Новый БлокировкаДанных;
	ЭлементБлокировки = Блокировка.Добавить("РегистрНакопления.BKM_ВыполненныеКлиентуРаботы");
	ЭлементБлокировки.Режим = РежимБлокировкиДанных.Исключительный;
	ЭлементБлокировки.УстановитьЗначение("Клиент", Контрагент);
	ЭлементБлокировки.УстановитьЗначение("Договор", Договор);
	Попытка
		
		Блокировка.Заблокировать();
		
	Исключение
	
		ОбщегоНазначения.СообщитьПользователю("Произошла ошибка блокировки данных. Документ не проведен.",,,,Отказ);
		Возврат;
		
	КонецПопытки;
		
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ЕСТЬNULL(РеализацияТоваровУслугУслуги.Сумма, 0)) КАК СуммаКОплате,
		|	РеализацияТоваровУслуг.Договор КАК Договор,
		|	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Ссылка) КАК ПредставлениеДокумента
		|ПОМЕСТИТЬ ВТ_СуммаКОплате
		|ИЗ
		|	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
		|		ПО РеализацияТоваровУслуг.Ссылка = РеализацияТоваровУслугУслуги.Ссылка
		|ГДЕ
		|	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
		|	И РеализацияТоваровУслугУслуги.Номенклатура В
		|			(ВЫБРАТЬ
		|				BKM_НоменклатураРаботыСпециалиста.Значение КАК Значение
		|			ИЗ
		|				Константа.BKM_НоменклатураРаботыСпециалиста КАК BKM_НоменклатураРаботыСпециалиста)
		|	И РеализацияТоваровУслуг.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РеализацияТоваровУслуг.Договор,
		|	РеализацияТоваровУслуг.Контрагент,
		|	ПРЕДСТАВЛЕНИЕССЫЛКИ(РеализацияТоваровУслуг.Ссылка)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_СуммаКОплате.СуммаКОплате КАК СуммаКОплате,
		|	ЕСТЬNULL(BKM_ВыполненныеКлиентуРаботыОстатки.КоличествоЧасовОстаток, 0) КАК КоличествоЧасовОстаток,
		|	ЕСТЬNULL(BKM_ВыполненныеКлиентуРаботыОстатки.СуммаКОплатеОстаток, 0) КАК СуммаКОплатеОстаток,
		|	ВТ_СуммаКОплате.Договор КАК Договор,
		|	ВТ_СуммаКОплате.Контрагент КАК Контрагент,
		|	ЕСТЬNULL(ВТ_СуммаКОплате.Договор.BKM_СтоимостьЧасаРаботыСпециалиста, 0) КАК СтоимостьЧасаРаботыСпециалиста,
		|	ВТ_СуммаКОплате.ПредставлениеДокумента КАК ПредставлениеДокумента
		|ИЗ
		|	ВТ_СуммаКОплате КАК ВТ_СуммаКОплате
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.BKM_ВыполненныеКлиентуРаботы.Остатки(
		|				&МоментВремени,
		|				Договор = &Договор
		|					И Клиент = &Контрагент) КАК BKM_ВыполненныеКлиентуРаботыОстатки
		|		ПО ВТ_СуммаКОплате.Договор = BKM_ВыполненныеКлиентуРаботыОстатки.Договор
		|			И ВТ_СуммаКОплате.Контрагент = BKM_ВыполненныеКлиентуРаботыОстатки.Клиент";
	
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Контрагент", Контрагент);
	Запрос.УстановитьПараметр("Договор", Договор);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если  Выборка.Следующий() Тогда   
			
		Если Выборка.СуммаКОплате > Выборка.СуммаКОплатеОстаток Тогда
			
			ТекстСообщения = СтрШаблон("Документ %1 не проведен. Требуемая сумма(%2) больше чем сумма выполненных работ (%3)",
					Выборка.ПредставлениеДокумента, Выборка.СуммаКОплате, Выборка.СуммаКОплатеОстаток);
			ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, "Документ не проведен");

			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
			
		КонецЕсли;
		
		
		
		Движения.BKM_ВыполненныеКлиентуРаботы.Записывать = Истина;
				
		Движение = Движения.BKM_ВыполненныеКлиентуРаботы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Клиент = Контрагент;
		Движение.Договор = Договор;
		Движение.СуммаКОплате = Выборка.СуммаКОплате;
		
		Если Выборка.СуммаКОплате = Выборка.СуммаКОплатеОстаток Тогда
			Движение.КоличествоЧасов = Выборка.КоличествоЧасовОстаток;
		Иначе
			
			Если Выборка.СтоимостьЧасаРаботыСпециалиста <> 0 Тогда
				Движение.КоличествоЧасов = Выборка.СуммаКОплате/Выборка.СтоимостьЧасаРаботыСпециалиста;	
			КонецЕсли;
			
		КонецЕсли;	
					
	КонецЕсли;
	
КонецПроцедуры

Процедура BKM_ВыполнитьАвтозаполнение() Экспорт
	
	Отказ = Ложь;
	НоменклатураАбонентскаяПлата = Константы.BKM_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.BKM_НоменклатураРаботыСпециалиста.Получить();
	
	Если Не ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		ТекстСообщения = "Значение константы НоменклатураАбонентскаяПлата не заполнено.";
		ОбщегоНазначения.СообщитьПользователю("Значение константы НоменклатураАбонентскаяПлата не заполнено.",,,,Отказ);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, "Документ не проведен");
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		ТекстСообщения = "Значение константы НоменклатураРаботыСпециалиста не заполнено.";
		ОбщегоНазначения.СообщитьПользователю("Значение константы НоменклатураРаботыСпециалиста не заполнено.",,,,Отказ);
		ЖурналРегистрации.ДобавитьСообщениеДляЖурналаРегистрации(ТекстСообщения, УровеньЖурналаРегистрации.Ошибка,,, "Документ не проведен");
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Услуги.Очистить();
		
	
	
	
КонецПроцедуры
// -- Кривошеев

#КонецОбласти 

#КонецЕсли
